package com.csii.dmp.fields;

/**
 * @Description TODO
 * @Author KG21_YANG
 * @Date 2019/10/22 9:47
 */
public class AppData {
    static String[][] apps = {{"XRX100001", "西瓜视频"}, {"XRX100002", "拼多多"}, {"XRX100003", "剪映"}, {"XRX100004", "抖音短视频"},
            {"XRX100005", "手机淘宝"}, {"XRX100006", "闲鱼"}, {"XRX100007", "腾讯视频"}, {"XRX100008", "京东"}, {"XRX100009", "支付宝"},
            {"XRX100010", "微信"}, {"XRX100011", "高德地图"}, {"XRX100012", "快手"}, {"XRX100013", "优酷视频"}, {"XRX100014", "美团"},
            {"XRX100015", "酷狗音乐"}, {"XRX100016", "搜狐视频"}, {"XRX100017", "钉钉"}, {"XRX100018", "腾讯新闻"}, {"XRX100019", "轻颜相机"},
            {"XRX100020", "58同城"}, {"XRX100021", "美团秀秀"}, {"XRX100022", "哈啰出行"}, {"XRX100023", "今日头条"}, {"XRX100024", "哔哩哔哩"},
            {"XRX100025", "探探"}, {"XRX100026", "知乎"}, {"XRX100027", "微博"}, {"XRX100028", "大众点评"}, {"XRX100029", "饿了么"}, {"XRX100030", "唯品会"},
            {"XRX100031", "飞猪"}, {"XRX100032", "安居客"}, {"XRX100033", "滴滴出行"}, {"XRX100034", "携程旅行"}, {"XRX100035", "作业帮"},
            {"XRX100036", "全民K歌"}, {"XRX100037", "铁路12306"}, {"XRX100038", "蘑菇街"}, {"XRX100039", "天眼查"}, {"XRX100040", "七猫小说"},
            {"XRX100041", "Keep"}, {"XRX100042", "盒马"}, {"XRX100043", "平安管家"}, {"XRX100044", "转转"}, {"XRX100045", "陌陌"}, {"XRX100046", "虎牙直播"},
            {"XRX100047", "叮咚买菜"}, {"XRX100048", "美颜相机"}, {"XRX100049", "货拉拉"}, {"XRX100050", "瓜子二手车"}, {"XRX100051", "掌上英雄联盟"},
            {"XRX100052", "斗鱼直播"}, {"XRX100053", "粉象生活"}, {"XRX100054", "链家"}, {"XRX100055", "唱吧"}, {"XRX100056", "花生日记"},
            {"XRX100057", "猫扑运动"}, {"XRX100058", "豆瓣"}, {"XRX100059", "蜜源"}, {"XRX100060", "爱彼迎"}, {"XRX100061", "去哪儿旅行"},
            {"XRX100062", "百度云盘"}, {"XRX100063", "百度文库"}, {"XRX100064", "极速火箭"}, {"XRX100065", "运动赚"}, {"XRX100066", "他趣"},
            {"XRX100067", "时间规划局"}, {"XRX100068", "爱奇艺"}, {"XRX100069", "熊猫吃短信"}, {"XRX100070", "隐形守护者"}, {"XRX100071", "香蕉视频"},
            {"XRX100072", "哔咔漫画"}, {"XRX100073", "爱美剧TV"}, {"XRX100074", "同花顺"}, {"XRX100075", "凤凰新闻"}, {"XRX100076", "Boss直聘"},
            {"XRX100077", "坚果加速"}, {"XRX100078", "P站助手"}, {"XRX100079", "蚂蚁书签"}, {"XRX100080", "网易邮箱大师"}, {"XRX100081", "恋爱话术"},
            {"XRX100082", "网盘搜索神器"}, {"XRX100083", "百合交友"}, {"XRX100084", "食物库"}, {"XRX100085", "人生必读经典读物"}, {"XRX100086", "皮皮虾"},
            {"XRX100087", "喜马拉雅FM"}, {"XRX100088", "得到"}, {"XRX100089", "起点读书"}, {"XRX100090", "珍爱网"}, {"XRX100091", "狼人杀"},
            {"XRX100092", "扫描全能王"}, {"XRX100093", "Soul"}, {"XRX100094", "猫耳FM"}, {"XRX100095", "比心"}, {"XRX100096", "南瓜电影"},
            {"XRX100097", "懒人听书"}, {"XRX100098", "花椒直播"}, {"XRX100099", "书旗小说"}, {"XRX100100", "快看漫画"}, {"XRX100101", "PP体育"},
            {"XRX100102", "世纪佳缘"}, {"XRX100103", "追书神器"}, {"XRX100104", "派派"}, {"XRX100105", "会玩"}, {"XRX100106", "混沌大学"},
            {"XRX100107", "猿辅导"}, {"XRX100108", "驾校一点通"}, {"XRX100109", "英灵勇士"}, {"XRX100110", "LOOK直播"}};

    public static int getAppDataLength() {
        return apps.length;
    }

    public static String getAppId(int index){
        return apps[index][0];
    }
    public static String getAppName(int index){
        return apps[index][1];
    }

}
